{
  "responsive-web-design": {
    "title": "Responsive Web Design",
    "intro": [
      "..ในการออกแบบ Responsive Web Design Certification นี้ คุณจะได้เรียนรู้โค้ดภาษาที่นักพัฒนาใช้ในการสร้างหน้าเว็บ: HTML (Hypertext Markup Language) สำหรับการออกแบบเนื้อหา และ CSS (Cascading Style Sheets) สำหรับการออกแบบหน้าเว็บไซต์",
      "ก่อนอื่น คุณจะต้องสร้างแอปรูปถ่ายแมวเพื่อเรียนรู้พื้นฐานของ HTML และ CSS ต่อมา คุณจะได้เรียนรู้เทคนิคสมัยใหม่ เช่น ตัวแปรของ CSS โดยการสร้าง Penguin และแนวทางที่ดีที่สุดสำหรับการสร้างเว็บฟอร์ม",
      "โดยท้ายที่สุดแล้ว คุณจะได้เรียนรู้วิธีสร้างหน้าเว็บที่ตอบสนองต่อขนาดหน้าจอต่างๆ โดยการสร้างการ์ด Twitter ด้วย Flexbox และรูปแบบบล็อกที่ซับซ้อนด้วย CSS Grid"
    ],
    "note": "โน้ต : การใช้เบราเซอร์เอ็กซ์เทนชันต่างๆ เช่น บล็อคโฆษณา, การใช้งานดาร์กโหมด อาจจะไปติดขัดในช่วงการทดสอบบ้างอย่าง ถ้าคุณเจอปัญหาเหล่านี้ พวกเราแนะนำให้คุณปิดการใช้งานเบราเซอร์เอ็กซ์เทนชันต่างๆ ขณะที่ทำการเรียนอยู่",
    "blocks": {
      "basic-html-and-html5": {
        "title": "Basic HTML and HTML5",
        "intro": [
          "HTML เป็นภาษากำกับข้อความ(มาร์กอัพ)ที่ใช้ซินแท็กซ์หรือสัญลักษณ์พิเศษเพื่ออธิบายโครงสร้างของหน้าเว็บไปยังเบราว์เซอร์ ซึ่งองค์ประกอบของ HTML จะมีแท็กเปิด แท็กปิดอยู่รอบๆที่ให้ความหมายกับเนื้อหาคอนเทนต์ เช่น องค์ประกอบต่างๆ ที่ใช้อธิบายข้อความที่เป็นหัวเรื่อง ย่อหน้า หรือรายการได้",
          "ในหลักสูตรนี้ คุณจะต้องสร้างแอปภาพถ่ายแมว เพื่อเรียนรู้องค์ประกอบของ HTML ที่พบบ่อยที่สุด ซึ่งเป็นส่วนประกอบสำคัญของหน้าเว็บได้"
        ]
      },
      "basic-css": {
        "title": "Basic CSS",
        "intro": [
          "CSS หรือ Cascading Style Sheets ทำหน้าที่บอกเบราว์เซอร์ ถึงวิธีการแสดงข้อความและเนื้อหาอื่น ๆ ที่คุณเขียนในภาษา HTML และด้วยภาษา CSS คุณสามารถควบคุมสี แบบอักษร ขนาด ระยะห่าง และองค์ประกอบของ HTML อื่น ๆ อีกมากมาย",
          "ถึงตอนนี้แล้ว คุณจะต้องอธิบายโครงสร้างของแอปรูปถ่ายแมวของคุณ โดยกำหนดสไตล์ด้วยภาษา CSS"
        ]
      },
      "applied-visual-design": {
        "title": "Applied Visual Design",
        "intro": [
          "การออกแบบภาพ (Visual design) เป็นการผสมผสานระหว่างการออกแบบตัวอักษร ทฤษฎีสี กราฟิก แอนิเมชั่น เค้าโครงหน้า และอื่นๆ เพื่อช่วยนำเสนอข้อความที่เป็นเอกลักษณ์ของคุณ",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้วิธีใช้องค์ประกอบต่างๆ ของการออกแบบภาพกับหน้าเว็บของคุณ"
        ]
      },
      "applied-accessibility": {
        "title": "Applied Accessibility",
        "intro": [
          "ในการพัฒนาเว็บไซต์ การเข้าถึง (accessibility) จะอ้างอิงถึงเนื้อหาเว็บไซต์และ UI (user interface)ที่จะช่วยให้สามารถเข้าใจ นำทางและโต้ตอบกับผู้ใช้ในวงกว้างได้ รวมถึงผู้ที่มีความบกพร่องทางการมองเห็น การได้ยิน การเคลื่อนไหว หรือการรับรู้",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้แนวทางในการปฏิบัติที่ดีที่สุดสำหรับการสร้างหน้าเว็บที่ทำให้ทุกคนสามารถเข้าถึงได้"
        ]
      },
      "responsive-web-design-principles": {
        "title": "Responsive Web Design Principles",
        "intro": [
          "มีอุปกรณ์มากมายที่ช่วยให้เข้าถึงเว็บได้ สามารถมาได้ทั้งแบบรูปทรงและขนาดต่างๆ ซึ่งการออกแบบเว็บให้ตอบสนอง ตามอุปกรณ์ คือ แนวทางปฏิบัติของการออกแบบเว็บไซต์ที่ดี ค่อนข้างยืดหยุ่นและสามารถตอบสนองต่อขนาดหน้าจอ การวางแนว และความละเอียดต่างๆ ได้",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้วิธีใช้ CSS เพื่อทำให้หน้าเว็บของคุณดูดี ไม่ว่าจะดูบนอุปกรณ์ใดก็ตาม"
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox เป็นวิธีการจัดวางที่มีประสิทธิภาพและได้รับการยอมรับเป็นอย่างดี ซึ่งได้รับการแนะนำด้วยภาษา CSS เวอร์ชั่นล่าสุดหรือ CSS3  ใน Flexbox จะช่วยให้ง่ายต่อการจัดองค์ประกอบบนหน้าเว็บไซต์และสร้าง UI แบบไดนามิกที่สามารถย่อและขยายโดยอัตโนมัติ",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้พื้นฐานการวางเลย์เอาท์แบบ Flexbox และแบบไดนามิก จากการสร้างการ์ด Twitter"
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          " CSS grid คือมาตรฐานใหม่ที่ช่วยให้ง่ายต่อการสร้างเลย์เอาท์ที่ตอบสนองแบบซับซ้อนได้ ทำงานได้โดยเปลี่ยนองค์ประกอบของ HTML ให้เป็น grid และให้วางองค์ประกอบย่อยไว้ที่ภายในเลย์เอาท์",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้พื้นฐานของ CSS grid โดยการสร้างเลย์เอาท์ที่ซับซ้อนแบบต่างๆ รวมถึงบล็อก(Blog)ด้วย"
        ]
      },
      "responsive-web-design-projects": {
        "title": "Responsive Web Design Projects",
        "intro": [
          "ถึงเวลาที่จะนำทักษะที่คุณเรียนรู้ไปใช้งานแล้ว การทำงานในโปรเจคนี้ คุณจะต้องใช้ทักษะ หลักการ และแนวคิดทั้งหมดที่คุณได้เรียนรู้มาใน: HTML, CSS, การออกแบบภาพ, การช่วยสำหรับการเข้าถึง(Accessibility) และเรื่องอื่นๆ .",
          "การทำโปรเจคเขียนเว็บทั้ง 5 โปรเจคด้านล่างนี้ ได้สำเร็จ จะได้รับประกาศนียบัตรด้านการออกแบบเว็บที่ตอบสนองตามอุปกรณ์ (Responsive Web Design)"
        ]
      },
      "basic-html-cat-photo-app": {
        "title": "Basic HTML Cat Photo App",
        "intro": ["", ""]
      },
      "basic-css-cafe-menu": {
        "title": "Basic CSS Cafe Menu",
        "intro": ["", ""]
      },
      "css-box-model": {
        "title": "CSS Box Model",
        "intro": [
          "Mark Rothko เป็นจิตรกรที่มีชื่อเสียง โดยการวาดภาพนามธรรมของเขา ภาพวาดของ Rothko มักจะแสดงถึงฟิล์มสี่เหลี่ยมสีในขนาดต่างๆ",
          "ในบทเรียนนี้ คุณจะใช้ CSS เพื่อสร้างภาพวาดของคุณเองตามสไตล์ของ Rothko โดยคุณจะใช้ทักษะมากมายที่คุณได้ฝึกฝนมาแล้ว รวมถึงเครื่องมือของ CSS ใหม่ เช่น การเบลอและการแปลงภาพอีกด้วย"
        ]
      },
      "css-variables-skyline": {
        "title": "CSS Variables Skyline",
        "intro": ["", ""]
      },
      "registration-form": { "title": "Registration Form", "intro": ["", ""] },
      "accessibility-quiz": {
        "title": "Accessibility Quiz",
        "intro": ["", ""]
      },
      "css-picasso-painting": {
        "title": "CSS Picasso Painting",
        "intro": [
          "Pablo Picasso เป็นที่รู้จักจากรูปแบบการวาดภาพแบบคิวบิสม์ของเขา ซึ่งเป็นรูปแบบที่แสดงถึงวัตถุที่พังทลายและประกอบขึ้นใหม่จากหลายมุมมอง ภาพวาดของ Picasso มักเป็นแสดงถึงนามธรรมขั้นสูงและการกระตุ้นความคิด",
          "ในหลักสูตรนี้ คุณจะใช้ CSS เพื่อสร้างภาพวาดของคุณเองตามสไตล์ของ Picasso คุณจะได้เรียนรู้เกี่ยวกับไอคอน FontAwesome SVG การวางตำแหน่งของ CSS และเสริมทักษะที่คุณพึ่งจะได้เรียนรู้ไป"
        ]
      },
      "css-piano": { "title": "CSS Piano", "intro": ["", ""] }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "JavaScript Algorithms and Data Structures",
    "intro": [
      "ในขณะที่ภาษา HTML และ CSS ควบคุมส่วนเนื้อหาและการจัดรูปแบบหน้าเว็บ แต่ JavaScript นั้นจะถูกใช้เพื่อทำให้เว็บไซต์สามารถโต้ตอบกับผู้ใช้ได้ ในคอร์ส JavaScript Algorithm and Data Structures Certification นี้คุณจะได้เรียนรู้พื้นฐานของภาษา JavaScript รวมถึงตัวแปร อาร์เรย์ อ็อบเจ็กต์ ลูป และฟังก์ชันด้วย .",
      "ถ้าคุณมีพื้นฐานอยู่แล้ว คุณสามารถนำความรู้นั้นไปใช้ได้เลย โดยอาจจะสร้างอัลกอริธึมเพื่อจัดการกับสตริง แยกตัวประกอบตัวเลข และแม้แต่คำนวณวงโคจรของสถานีอวกาศนานาชาติ",
      "ในระหว่างการเรียนนี้ คุณจะได้เรียนรู้รูปแบบการเขียนโปรแกรมหรือตัวอย่างที่สำคัญ อยู่สองรูปแบบคือ: Object Oriented Programming (OOP) และ Functional Programming (FP)"
    ],
    "note": "โน้ต : การใช้เบราเซอร์เอ็กซ์เทนชันต่างๆ เช่น บล็อคโฆษณา, การใช้งานดาร์กโหมด อาจจะไปติดขัดในช่วงการทดสอบบ้างอย่าง ถ้าคุณเจอปัญหาเหล่านี้ พวกเราแนะนำให้คุณปิดการใช้งานเบราเซอร์เอ็กซ์เทนชันต่างๆ ขณะที่ทำการเรียนอยู่",
    "blocks": {
      "basic-javascript": {
        "title": "Basic JavaScript",
        "intro": [
          "JavaScript เป็นภาษาโปรแกรมที่สามารถใช้เพื่อทำให้หน้าเว็บโต้ตอบกลับผู้ใช้ได้ ซึ่งเป็นหนึ่งในเทคโนโลยีหลักของเว็บ พร้อมด้วย HTML และ CSS และเป็นที่นิยมของเบราว์เซอร์สมัยใหม่ทั้งหมด",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้แนวคิดการเขียนโปรแกรมพื้นฐานใน JavaScript เริ่มต้นด้วยโครงสร้างข้อมูลพื้นฐาน เช่น ตัวเลขและสตริง หลังจากนั้น คุณจะได้เรียนรู้การทำงานกับอาร์เรย์ อ็อปเจ็กต์ ฟังก์ชัน ลูป คำสั่ง if/else และ อื่นๆ."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript หรือ ES คือเวอร์ชั่นมาตรฐานของภาษา JavaScript เนื่องจากเบราว์เซอร์หลักทั้งหลายเป็นไปตามข้อกำหนดของ ECMAScript และ JavaScript จึงทำให้สามารถใช้แทนกันได้",
          " ในภาษา JavaScript ส่วนใหญ่ที่คุณได้เรียนรู้มาจนถึงตอนนี้จะเขียนอยู่ใน ES5 (ECMAScript 5) ซึ่งปรับปรุงล่าสุดในปี 2552 ในขณะที่คุณยังคงเขียนโปรแกรมใน ES5 ได้ แต่ JavaScript มีการพัฒนาอย่างต่อเนื่องและมีการเปิดตัวคุณสมบัติใหม่ทุกปี",
          "ES6 ที่เปิดตัวในปี 2015 ได้เพิ่มคุณสมบัติใหม่ๆ ที่มีประสิทธิภาพให้มากขึ้น ในหลักสูตรนี้ คุณจะได้เรียนรู้คุณลักษณะใหม่เหล่านี้ รวมถึง <code>let</code> และ <code>const</code> ฟังก์ชันลูกศร คลาส(classes) โพรมมิส(promises) และโมดูล"
        ]
      },
      "regular-expressions": {
        "title": "Regular Expressions",
        "intro": [
          "นิพจน์ทั่วไป (Regular expression) มักจะย่อเป็น \"regex\" หรือ \"regexp\" ซึ่งเป็นรูปแบบที่ช่วยให้โปรแกรมเมอร์จับคู่ ค้นหา หรือแทนที่ข้อความได้ นิพจน์ทั่วไปนั้นมีประสิทธิภาพมาก แต่อาจจะอ่านค่อนข้างยาก เนื่องจากมีการใช้อักขระพิเศษ มีการสร้างแมตช์ที่ซับซ้อนและมีความยืดหยุ่นมาก",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้วิธีใช้อักขระพิเศษ, แคปเจอร์กรุ๊ป (Capture groups), Positive lookaheads, Negative lookaheads และเทคนิคอื่นๆ เพื่อจับคู่ข้อความตามที่คุณต้องการ"
        ]
      },
      "debugging": {
        "title": "Debugging",
        "intro": [
          "ดีบัก (Debugging) เป็นขั้นตอนในระหว่างการเขียนโค้ด ขณะที่พบปัญหา คุณต้องทำการแก้ไขปัญหานั้น",
          "ปัญหาในโค้ดโดยทั่วไปมีอยู่สามรูปแบบ: 1. ข้อผิดพลาดทางซินแทกซ์ (Syntax errors) ที่ป้องกันไม่ให้โปรแกรมของคุณทำงาน 2. ข้อผิดพลาดทางรันไทม์ (Runtime errors) ที่โค้ดของคุณมีพฤติกรรมที่ไม่คาดคิด 3. ข้อผิดพลาดทางด้านตรรกะ (Logical errors) ที่โค้ดของคุณไม่ทำในสิ่งที่คุณตั้งใจไว้",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้วิธีใช้คอนโซลของ JavaScript เพื่อการดีบักโปรแกรมและป้องกันปัญหาทั่วไปก่อนที่จะเกิดขึ้น"
        ]
      },
      "basic-data-structures": {
        "title": "Basic Data Structures",
        "intro": [
          "ข้อมูลสามารถจัดเก็บและเข้าถึงได้หลายวิธี คุณก็รู้อยู่แล้วคือ โครงสร้างข้อมูลโดยทั่วไปของ JavaScript เช่น อาร์เรย์และออปเจ็ค",
          "ในหลักสูตรนี้ โครงสร้างข้อมูลพื้นฐาน คุณจะได้เรียนรู้เพิ่มเติมเกี่ยวกับความแตกต่างระหว่างอาร์เรย์และออปเจ็ค และสิ่งที่ควรใช้ในสถานการณ์ต่างๆ รวมทั้งยังจะได้เรียนรู้วิธีการใช้วิธีของ JS ที่เป็นประโยชน์ในการเขียนโค้ด เช่น <code>splice()</code > และ <code>Object.keys()</code> เพื่อเข้าถึงและจัดการข้อมูลได้"
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Basic Algorithm Scripting",
        "intro": [
          "อัลกอริทึม คือ ชุดคำสั่งที่ทำที่ละขั้นตอน เพื่ออธิบายถึงวิธีการของการทำบางสิ่งบางอย่าง",
          "ในการเขียนอัลกอริธึมให้มีประสิทธิภาพ ต้องการแยกปัญหาออกเป็นส่วนย่อย ๆ และคิดอย่างรอบด้านเกี่ยวกับวิธีแก้ปัญหาแต่ละส่วน ด้วยโค้ด",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้พื้นฐานของการคิดอัลกอริธึมโดยการเขียนอัลกอริธึมที่ทำทุกอย่างตั้งแต่การแปลงอุณหภูมิไปจนถึงการจัดการอาร์เรย์ 2 มิติที่ซับซ้อน"
        ]
      },
      "object-oriented-programming": {
        "title": "Object Oriented Programming",
        "intro": [
          "OOP หรือ Object Oriented Programming เป็นหนึ่งในแนวทางที่สำคัญในกระบวนการพัฒนาซอฟต์แวร์ ใน OOP ออปเจ็คและคลาสจะทำการจัดระเบียบโค้ดเพื่ออธิบายสิ่งต่างๆ และสิ่งที่สามารถทำได้",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้หลักการพื้นฐานของ OOP ใน JavaScript รวมถึงคีย์เวิร์ด <code>this</code>  โปรโตไทป์เชน (Prototype chain), คอนสตรัคเตอร์ (constructors), และอินเฮอริแทนซ์ (Inheritance)"
        ]
      },
      "functional-programming": {
        "title": "Functional Programming",
        "intro": [
          "Functional Programming เป็นแนวทางอีกแนวทางหนึ่งที่ได้รับความนิยมในการพัฒนาซอฟต์แวร์ ใน Functional Programming จะทำให้โค้ดที่เป็นฟังก์ชันพื้นฐานมีขนาดเล็กลง ซึ่งสามารถนำมารวมกันเพื่อสร้างเป็นโปรแกรมที่ซับซ้อนได้",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้แนวคิดหลักของ Functional Programming รวมถึงฟังก์ชันต่าง ๆ รวมถึงวิธีหลีกเลี่ยงการกลายพันธุ์ (Mutations) และวิธีเขียนโค้ดให้คลีน (Cleaner code) ด้วยวิธีการต่างๆ เช่น <code>.map()</code> และ <code>.filter ()</code>"
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Intermediate Algorithm Scripting",
        "intro": [
          "ถึงตอนนี้ คุณก็มีความรู้พื้นฐานของการคิดอัลกอริธึมพร้อมกับ OOP และ Functional Programming แล้ว  ในหัวข้อ Intermediate Algorithm Scripting นี้ จะมีโจทย์ให้คุณทดสอบทักษะที่คุณได้เรียนรู้มาเรียบร้อยแล้ว"
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "JavaScript Algorithms and Data Structures Projects",
        "intro": [
          "ถึงเวลาแล้วที่จะนำทักษะ JavaScript อันใหม่ของคุณไปใช้งานจริง โปรเจคเหล่านี้คล้ายกับโจทย์ความท้าทายในการเขียนสคริปต์อัลกอริทึมที่คุณเคยทำมาก่อนหน้านี้ แต่ว่าจะมีความยากกว่ามาก ให้คุณได้ลองมาทดลองเขียนกัน",
          "ทำโปรเจค JavaScript ทั้ง 5 โปรเจคให้สำเร็จ เพื่อรับใบประกาศไปรษณียบัตร JavaScript Algorithms and Data Structures"
        ]
      },
      "basic-javascript-rpg-game": {
        "title": "Basic JavaScript RPG Game",
        "intro": ["", ""]
      },
      "intermediate-javascript-calorie-counter": {
        "title": "Intermediate JavaScript Calorie Counter",
        "intro": ["", ""]
      },
      "functional-programming-spreadsheet": {
        "title": "Functional Programming Spreadsheet",
        "intro": ["", ""]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Front End Development Libraries",
    "intro": [
      "เมื่อคุณคุ้นเคยกับภาษา HTML, CSS และ JavaScript แล้ว ต่อมาจะมาเพิ่มระดับทักษะของคุณด้วยการเรียนรู้ Frond-end libraries ที่เป็นที่นิยมในอุตสาหกรรม",
      "ซึ่งใน Front End Development Libraries Certification คุณจะได้เรียนรู้วิธีจัดรูปแบบเว็บไซต์ของคุณอย่างรวดเร็วด้วย Bootstrap และเรียนรู้วิธีเพิ่มตรรกะให้กับสไตล์ของ CSS รวมถึงการขยายรูปด้วย Sass",
      "หลังจากนั้น คุณจะได้เรียนรู้ในการสร้างตะกร้าสินค้าและแอปพลิเคชันอื่นๆ เพื่อเรียนรู้วิธีสร้างอย่าง Single Page Application (SPA) อันทรงพลังด้วย React และ Redux"
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap เป็น Front-End framework ที่ใช้ในการออกแบบหน้าเว็บและแอปพลิเคชันที่มีการตอบสนองกับผู้ใช้ ซึ่งต้องใช้โมบายเฟิร์ส(Mobile-first)ในการพัฒนาเว็บไซต์ และรวมถึงรูปแบบและคลาส CSS ที่สร้างไว้ล่วงหน้า บวกกับฟังก์ชันการทำงานของ JavaScript บางอย่าง",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้วิธีสร้างเว็บไซต์ที่ตอบสนองด้วย Bootstrap และใช้คลาสที่รวมไว้เพื่อจัดรูปแบบปุ่ม รูปภาพ แบบฟอร์ม การนำทาง และองค์ประกอบทั่วไป ๆ"
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery เป็นหนึ่งในไลบรารีของ JavaScript ที่ใช้กันอย่างแพร่หลายมากที่สุดในโลก",
          "ในปีค.ศ. 2006 เมื่อทำการเปิดตัว jQuery ทำให้เบราว์เซอร์หลักที่ใช้ JavaScript นั้นแตกต่างกันเล็กน้อย ซึ่ง jQuery ทำให้กระบวนการเขียน JavaScript ฝั่งไคลเอ็นต์ง่ายขึ้น และยังช่วยให้มั่นใจว่าโค้ดของคุณทำงานในลักษณะเดียวกันในทุกเบราว์เซอร์",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้วิธีใช้ jQuery เพื่อทำการเลือก ลบ โคลน และแก้ไของค์ประกอบต่างๆ ในหน้าเว็บเพจ"
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass หรือ \"Syntactically Awesome StyleSheets\" เป็นส่วนขยายภาษาของ CSS ทำหน้าที่เพิ่มคุณสมบัติที่ไม่มีใน CSS พื้นฐาน ซึ่งทำให้ง่ายต่อการดูแลและรักษาสไตล์ชีต (Stylesheet) สำหรับโปรเจคของคุณ",
          "ในหลักสูตร Sass นี้ คุณจะได้เรียนรู้วิธีจัดเก็บข้อมูลในตัวแปร, nest CSS, สร้างสไตล์ที่นำกลับมาใช้ใหม่ได้ด้วยมิกซ์อินต่างๆ, เพิ่มตรรกะและลูปให้เข้ากับสไตล์ของคุณ และอื่นๆ"
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React เป็นไลบรารีของ JavaScript ที่มีความยอดนิยมมาก ในการทำให้สร้างอินเทอร์เฟซผู้ใช้ (UI) ใช้ซ้ำได้และเป็นตัวขับเคลื่อน component สำหรับการสร้างหน้าเว็บหรือแอปพลิเคชัน",
          "React นั้นเป็นการรวม HTML กับฟังก์ชันของ JavaScript เข้าด้วยกัน เป็นภาษามาร์กอัปของตัวเองที่เรียกว่า JSX นอกจากนี้ React ยังช่วยให้การจัดการการไหลของข้อมูลทั่วทั้งแอปพลิเคชันได้ง่ายขึ้น",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้วิธีสร้าง React components ต่างๆ จัดการข้อมูลในรูปแบบของ State props และใช้วิธี lifecycle ต่างๆ เช่น <code>componentDidMount</code> และอื่นๆ อีกมากมาย"
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "เมื่อแอปพลิเคชันมีขนาดและขอบเขตใหญ่ขึ้น การจัดการข้อมูลที่แชร์กันก็จะ ยากขึ้นด้วย ซึ่ง Redux จะถูกกำหนดให้เป็น \"Container state ที่สามารถคาดการณ์ได้สำหรับแอป JavaScript\" ที่ช่วยให้มั่นใจว่าแอปของคุณทำงานได้อย่างมีทิศทาง และทดสอบได้ง่ายขึ้น",
          "ในขณะที่คุณสามารถใช้ Redux กับวิวไลบรารี่ใดๆ ก็ตาม พวกเราได้แนะนำ Redux ที่นี่ก่อนที่จะรวมเข้ากับ React ในชุดหลักสูตรถัดไป",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้พื้นฐานของการกักเก็บ(store) การดำเนินการ รีดิวเซอร์ และมิดเดิลแวร์ของ Redux เพื่อจัดการข้อมูลทั้งแอปพลิเคชันของคุณ"
        ]
      },
      "react-and-redux": {
        "title": "React and Redux",
        "intro": [
          "React และ Redux มักจะพูดถึงร่วมกันและด้วยเหตุผลที่ดี นักพัฒนาที่สร้าง Redux ก็เป็นนักพัฒนา React ที่ต้องการทำให้การแบ่งปันข้อมูลใน component ต่างๆ ง่ายขึ้น",
          "ถึงตอนนี้ คุณรู้วิธีการจัดการการไหลของข้อมูลที่แชร์กับ Redux แล้ว ก็ถึงเวลานำความรู้นั้นกับ React ในหลักสูตร React และ Redux ของคุณมาสร้าง React components และเรียนรู้เกี่ยวกับวิธีจัดการกับ stage ในส่วนของ component ตลอดทั้งแอปพลิเคชันด้วย Redux"
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Front End Development Libraries Projects",
        "intro": [
          "ถึงเวลาแล้ว ที่จะลองนำทักษะความรู้ด้าน Front-end development และไลบราลี่ของคุณ ใช้ Bootstrap, jQuery, Sass, React และ Redux นี้ทำโปรเจคทั้ง 5 โปรเจคนี้ เพื่อที่จะทดสอบสิ่งที่คุณได้เรียนรู้มาจนถึงตอนนี้",
          "ทำโปรเจคทั้ง 5 โปรเจคให้สำเร็จ เพื่อรับใบประกาศไปรษณียบัตรด้าน Front End Development Libraries"
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Data Visualization",
    "intro": [
      "ข้อมูล ดาต้า ข่าวสารมีอยู่มากมายรายล้อมรอบตัวเรา แต่ก็ไม่ได้มีความหมายมากนักหากไม่มีรูปร่างหรือบริบทที่ชัดเจน",
      "ในการรับรองการแสดงข้อมูลหรือ Data Visualization คุณจะต้องนำข้อมูลมาสร้างแผนภูมิ กราฟ หรือแผนที่เพื่อนำเสนอข้อมูลประเภทต่างๆ โดยสามารถทำได้ด้วยการใช้ไลบรารี D3.js",
      "นอกจากนี้ คุณยังจะได้เรียนรู้เกี่ยวกับ JSON (JavaScript Object Notation) และวิธีการทำงานกับข้อมูลออนไลน์โดยใช้ API (Application Programming Interface) อีกด้วย"
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Data Visualization with D3",
        "intro": [
          "D3 หรือ D3.js ย่อมาจาก Data Driven Documents เป็นไลบรารีอย่างหนึ่งของ JavaScript มีหน้าที่สร้างการแสดงข้อมูลแบบไดนามิกหรือการโต้ตอบกับผู้ใช้ในเบราว์เซอร์",
          "โดย D3 สร้างขึ้นมาทำงานร่วมกับเว็บทั่วไป นั่นก็คือ HTML, CSS และ Scalable Vector Graphics (SVG)",
          "D3 สามารถรองรับรูปแบบการอินพุตข้อมูลได้หลายประเภท โดยเมื่อรับข้อมูลมาแล้วจะใช้วิธีการที่มีประสิทธิภาพในการ Build-in ข้อมูลและจะแปลงข้อมูลเหล่านั้นเป็นแผนภูมิ กราฟ หรือแผนที่ต่างๆ ได้",
          "ในหลักสูตร Data Visualization with D3 คุณจะได้เรียนรู้วิธีการทำงานกับข้อมูลต่างๆ เพื่อสร้างแผนภูมิ กราฟ เอเลเมนท์แบบโฮเวอร์ (Hover elements) และ ingredients อื่นๆ เพื่อสร้างการแสดงข้อมูลแบบไดนามิกที่มีอินเตอร์เล็กชั่นและมีความน่าสนใจ"
        ]
      },
      "json-apis-and-ajax": {
        "title": "JSON APIs and AJAX",
        "intro": [
          "JSON มีลักษณะเหมือนกับวิธีที่ UI ประเภทต่างๆ ที่ช่วยให้ผู้ใช้ใช้โปรแกรม API (Application Programming Interfaces) ได้และช่วยให้โปรแกรมสามารถโต้ตอบกับโปรแกรมอื่นๆได้ ส่วน API เป็นเครื่องมือที่คอมพิวเตอร์ใช้ในการสื่อสารระหว่างกัน ส่วนหนึ่งใช้ในการส่งและอีกส่วนหนึ่งรับข้อมูล",
          "โปรแกรมเมอร์มักจะใช้ AJAX (Asynchronous JavaScript และ XML) ร่วมกับ APIs ต่างๆ โดย AJAX คือกลุ่มเทคโนโลยีที่ส่งคำขอแบบ Asynchronous ไปยังเซิร์ฟเวอร์เพื่อถ่ายโอนข้อมูล จากนั้นจะโหลดข้อมูลที่ส่งคืนมายังเว็บเพจ และข้อมูลที่ถูกถ่ายโอนระหว่างเบราว์เซอร์กับเซิร์ฟเวอร์ ซึ่งจะอยู่ในรูปแบบที่เรียกว่า JSON (JavaScript Object Notation)",
          "ในหลักสูตรนี้จะสอนพื้นฐานเกี่ยวกับการทำงานของ API และเทคโนโลยี AJAX ต่างๆ ในเบราว์เซอร์"
        ]
      },
      "data-visualization-projects": {
        "title": "Data Visualization Projects",
        "intro": [
          "ถึงตอนนี้แล้ว คุณคงจะได้เรียนรู้วิธีทำงานกับเทคโนโลยีใน D3, API และ AJAX มาบ้างแล้ว งั้นเรามามาทดสอบทักษะของคุณกับโปรเจค Data Visualization ทั้ง 5 โครงการกัน",
          "ในโปรเจคเหล่านี้ คุณจะต้องทำการดึงข้อมูล, แยกและวิเคราะห์ชุดข้อมูล หลังจากนั้นใช้ D3 สร้างการแสดงข้อมูลในรูปแบบต่าง ๆ",
          "การทำโปรเจคทั้ง 5 ได้สำเร็จจะได้รับประกาศไปรษณียบัตรทางด้าน Data Visualization"
        ]
      },
      "d3-dashboard": { "title": "D3 Dashboard", "intro": ["", ""] }
    }
  },
  "relational-databases": {
    "title": "Relational Databases",
    "intro": [
      "สำหรับหลักสูตรนี้ คุณจะได้ใช้เครื่องมือและซอฟต์แวร์สำหรับนักพัฒนาจริงๆ ซึ่งรวมถึงการใช้โปรแกรม VS Code, PostgreSQL และ Command line ใน Linux / Unix เพื่อทำแบบฝึกหัดเกี่ยวกับการโต้ตอบและสร้างโปรเจค"
    ],
    "blocks": {
      "learn-relational-databases": {
        "title": "Learn Relational Databases",
        "intro": [
          "ในหลักสูตรนี้ เริ่มต้นด้วยการใช้คำสั่งพื้นฐานของ Bash โดยการใช้เทอร์มินัล (Terminal) นี้ คุณจะได้เรียนรู้ทุกอย่างตั้งแต่การนำทาง (Navigating), การจัดการระบบไฟล์ (Manipulating), การเขียนสคริปต์ใน Bash ไปจนถึงการใช้งานขั้นสูง",
          "ต่อไป คุณจะได้เรียนรู้วิธีการสร้างและทำงานกับฐานข้อมูลเชิงสัมพันธ์ (Relational databases) โดยใช้ PostgreSQL ซึ่งเป็นระบบจัดการฐานข้อมูล และ SQL ซึ่งเป็นภาษาของฐานข้อมูลเหล่านี้",
          "และสุดท้าย คุณจะได้เรียนรู้ Git ในระบบควบคุมเวอร์ชัน และ GitHub ซึ่งเป็นโฮสต์สำหรับที่เก็บโค้ด ซึ่งเป็นเครื่องมือสำคัญสองอย่างสำหรับนักพัฒนาซอฟต์แวร์ทุกคน"
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Back End Development and APIs",
    "intro": [
      "จนถึงตอนนี้ คุณคงจะคุ้นกับการใช้ JavaScript ทางด้าน Frond-end เพื่อเพิ่มการโต้ตอบในหน้าเพจ, แก้ปัญหาอัลกอริทึม หรือสร้าง SPA แล้ว แต่ว่า JavaScript ยังมีสามารถที่ใช้ในด้าน Back-end หรือส่วนของเซิร์ฟเวอร์อีกด้วย ซึ่งทำหน้าที่ในการสร้างเว็บแอปพลิเคชันทั้งหมด .",
      "ในปัจจุบัน วิธีหนึ่งที่ได้รับความนิยมมากที่สุดในการสร้างแอปพลิเคชัน คงจะเป็นการสร้างผ่านไมโครเซอร์วิส ซึ่งเป็นแอปพลิเคชันโมดูลาร์ขนาดเล็กที่ทำงานร่วมกันเพื่อสร้างภาพรวมที่ใหญ่ขึ้น",
      "ใน Back-End Development และ APIs Certification นั้น คุณจะได้เรียนรู้วิธีเขียนแอปแบบ Back-End ด้วย Node.js และ npm (Node Package Manager) นอกจากนี้คุณยังจะได้สร้างเว็บแอปพลิเคชันด้วย Express Framework และสร้างไมโครเซอร์วิสของ People Finder ด้วย MongoDB และไลบราลี่ Mongoose อีกด้วย"
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Managing Packages with NPM",
        "intro": [
          "npm (Node Package Manager) คือ เครื่องมือ command line ที่ใช้ในการติดตั้ง สร้าง และแชร์ package ของโค้ด JavaScript ที่เขียนขึ้นใน Node.js ซึ่งใน npm มีโอเพ่นซอร์ส package มากมาย ที่สามารถนำมาใช้ได้เลย ดังนั้นก่อนที่จะเริ่มทำโปรเจคของคุณ ให้คุณใช้เวลาในการศึกษาเพิ่มเติม เพื่อที่คุณจะได้ไม่ต้องสร้างโค้ดใหม่สำหรับบางสิ่ง ที่มีอยู่แล้วใน npm เช่น การทำงานเกี่ยวกับวันที่หรือการดึงข้อมูลจาก API",
          "ซึ่งในหลักสูตรนี้ คุณจะได้เรียนรู้พื้นฐานของการใช้ npm รวมถึงวิธีการทำงานกับ <code>package.json</code> และวิธีการจัดการ dependencies ที่คุณติดตั้งไว้"
        ]
      },
      "basic-node-and-express": {
        "title": "Basic Node and Express",
        "intro": [
          "Node.js คือ JavaScript แบบ runtime ที่มีไว้เพื่อช่วยให้นักพัฒนาสามารถเขียนโปรแกรม Back-end (Server-side) ใน JavaScript ได้อย่างราบรื่นขึ้น ซึ่ง Node.js มาพร้อมกับโมดูล Build-in ที่เป็นโปรแกรมอิสระขนาดเล็ก สามารถช่วยในเรื่องนี้ได้ บางโมดูลหลัก (core module) รวมถึง HTTP ที่ทำหน้าที่เหมือนกับเป็นเซิร์ฟเวอร์ และ File System ซึ่งเป็นโมดูลสำหรับอ่านและแก้ไขไฟล์",
          "ซึ่งในหลักสูตรล่าสุดที่คุณเรียน วิธีการติดตั้งและจัดการ package จาก npm ซึ่งเป็นคอลเล็กชัน(Collections) ของโมดูลย่อย ซึ่ง package เหล่านี้สามารถช่วยให้คุณสร้างแอปพลิเคชันขนาดใหญ่และซับซ้อนยิ่งขึ้นได้",
          "Express คือ เฟรมเวิร์กของเว็บแอปพลิเคชันไลท์เวท (lightweight web application framework) และเป็นหนึ่งใน package ที่นิยมใช้บน npm, ซึ่ง Express ช่วยให้การสร้างเซิร์ฟเวอร์และจัดการการกำหนดเส้นทางสำหรับแอปพลิเคชันของคุณง่ายขึ้นมาก ซึ่งช่วยจัดการสิ่งต่างๆ เช่น นำผู้คนไปยังหน้าที่ถูกต้องเมื่อพวกเขาเยี่ยมชม ปลายทางบางอย่าง เช่น  <pre>/blog</pre>",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้พื้นฐานของ Node และ Express รวมถึงวิธีการสร้างเซิร์ฟเวอร์ ที่ให้บริการไฟล์ต่างๆ และจัดการคำขอต่างๆ จากเบราว์เซอร์อีกด้วย"
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB and Mongoose",
        "intro": [
          "MongoDB เป็นแอปพลิเคชันฐานข้อมูลที่เอาไว้เก็บเอกสารใน JSON (หรือ record) ซึ่งคุณสามารถนำใช้ได้ในแอปพลิเคชันของคุณได้เลย ซึ่งแตกต่างจาก SQL ที่เป็นฐานข้อมูลอีกรูปแบบหนึ่ง ที่เก็บข้อมูลแบบเป็นตารางที่ตั้งไว้ล่วงหน้า(Preset table) ส่วน Mongo นั้นจะจัดเก็บที่เกี่ยวข้องทั้งหมดใน record ที่เดียว ซึ่ง Mongo นั้นเป็นฐานข้อมูลที่ไม่เกี่ยวข้องกับฐานข้อมูล \"NoSQL\" เลย ",
          "Mongoose เป็น package ยอดนิยมบน npm ที่มักจะติดตั้งควบคู่ไปกับ Mongo, ด้วย Mongoose ของคุณสามารถใช้ออปเจ็คแบบธรรมดาของ JavaScript แทน JSON ได้ ซึ่งทำให้การทำงานกับ Mongo ทำได้ง่ายขึ้น นอกจากนี้ยังช่วยให้คุณสร้างบูลปริ้นท์ (blueprint) ในเอกสารของคุณที่ เรียกว่า Schema ได้อีกด้วย เพื่อเป็นการป้องกัน ไม่ให้คุณบันทึกข้อมูลผิดประเภทโดยที่ไม่ได้ตั้งใจหรือทำให้เกิดข้อผิดพลาดบั๊ก (Bugs) ในภายหลัง",
          "ในหลักสูตรของ MongoDB และ Mongoose คุณจะได้เรียนรู้เกี่ยวกับพื้นฐานของการทำงานกับข้อมูลถาวร รวมถึงวิธีการตั้งค่าโมเดล และการบันทึก การลบ และการค้นหาเอกสารในฐานข้อมูลดาต้าเบสอีกด้วย"
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Back End Development and APIs Projects",
        "intro": [
          "คุณคงอาจจะทำงานกับ API มาก่อนหน้านี้ แต่ตอนนี้เมื่อคุณรู้จักกับ npm, Node, Express, MongoDB และ Mongoose แล้ว ก็ถึงเวลาสร้างแอปพลิเคชันของคุณเอง ให้คุณใช้ความคิดเกี่ยวกับสิ่งที่คุณได้เรียนรู้มาจนถึงปัจจุบัน เพื่อสร้าง microservices 5 ตัวที่แตกต่างกัน ซึ่งจะเป็นแอปพลิเคชันขนาดเล็กที่มีขอบเขตที่จำกัด",
          "หลังจากสร้างแอปพลิเคชันเหล่านี้ คุณจะมี microservices API เจ๋งๆ 5 ตัวที่คุณสามารถเอาไปอวดเพื่อน ครอบครัว หรือนายจ้างของคุณได้ และคุณอาจจะได้เป็น Back-End Development รุ่นใหม่ที่ยอดเยี่ยมรวมถึงยังได้รับ APIs Certification อีกด้วย"
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Quality Assurance",
    "intro": [
      "เนื่องจากโปรแกรมหรือเว็บแอปพลิเคชันของคุณนั้นมีความซับซ้อนที่มากขึ้น คุณจะต้องทำการทดสอบ เพื่อให้แน่ใจว่าการปรับเปลี่ยนใหม่นั้นจะไม่ทำให้ฟังก์ชันการทำงานเดิมเสียหาย",
      "ในการรับรองการประกันคุณภาพ(Quality Assurance) คุณจะได้เรียนรู้วิธีเขียนโค้ดการทดสอบกับ Chai เพื่อรับรองให้แน่ใจว่าแอปพลิเคชันของคุณทำงานตามแบบที่คุณคิดไว้",
      "หลังจากนั้น คุณจะต้องสร้างแอปพลิเคชันแชทเพื่อเรียนรู้แนวคิดขั้นสูงของ Node และ Express นอกจากนี้ คุณยังต้องใช้ Pug เป็นเอ็นจิ้นเทมเพลต(Template engine) อีกรวมถึงใช้ Passport เพื่อทำการตรวจสอบสิทธิ์ และ Socket.io สำหรับการสื่อสารแบบเรียลไทม์ระหว่างเซิร์ฟเวอร์และไคลเอ็นต์ที่เชื่อมต่อ"
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Quality Assurance and Testing with Chai",
        "intro": [
          " Chai คือไลบรารีทดสอบของ JavaScript ที่ช่วยทำให้ยืนยันได้ว่าโปรแกรมสามารถทำงานตามที่คุณคาดหวังได้หลังจากที่คุณทำการปรับเปลี่ยนโค้ดแล้ว",
          "การใช้ Chai คุณสามารถเขียนโค้ดการทดสอบที่อธิบายข้อกำหนดของโปรแกรมของคุณและดูว่าโปรแกรมของคุณตรงตามข้อกำหนดได้หรือไม่",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้เกี่ยวกับการยืนยัน(assertion) ความเท่าเทียมกันแบบลึก(Deep equality) ความจริง(Truthiness) การทดสอบ API และพื้นฐานอื่นๆ สำหรับการทดสอบแอปพลิเคชันใน JavaScript"
        ]
      },
      "advanced-node-and-express": {
        "title": "Advanced Node and Express",
        "intro": [
          "ถึงเวลาเจาะลึกเกี่ยวกับ Node.js และ Express.js ด้วยการสร้างแอปพลิเคชันแชทด้วยระบบลงชื่อเข้าใช้ (sign-in system)",
          "ในการใช้ระบบลงชื่อเข้าใช้ (sign-in system) อย่างปลอดภัย คุณจะต้องเรียนรู้เกี่ยวกับการรับรองความถูกต้อง รวมถึงการตรวจสอบตัวตนของบุคคลหรือกระบวนการด้วย",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้วิธีใช้ Passport เพื่อจัดการการพิสูจน์ตัวตน และการใช้ Pug เพื่อสร้างเทมเพลตที่ใช้ซ้ำกันได้ ในส่วนการสร้าง Front-end แบบรวดเร็ว หรือ Web sockets สำหรับการสื่อสารแบบเรียลไทม์ระหว่างฝั่งไคลเอนต์กับฝั่งเซิร์ฟเวอร์"
        ]
      },
      "quality-assurance-projects": {
        "title": "Quality Assurance Projects",
        "intro": [
          "เมื่อคุณมีความรู้และมีความเชี่ยวชาญทางด้าน Front-end และ Back-end แล้ว ก็ถึงเวลาที่จะใช้ทักษะและแนวคิดเหล่านี้มาใช้ทำงานจริงๆ โดยคุณจะต้องสร้างเว็บแอปพลิเคชันที่แตกต่างกันทั้งหมด 5 แบบ และทำการทดสอบสำหรับแต่ละเว็บแอปพลิเคชัน เพื่อให้แน่ใจว่าใช้งานได้และสามารถจัดการกับเคสกรณีต่างๆ ได้อย่างถูกต้อง",
          "หลังจากเสร็จสิ้นการทำ Quality Assurance เหล่านี้แล้ว คุณก็จะได้มีโปรเจคอีก 5 โปรเจคและใบประกาศนียบัตรใหม่ เพื่อเป็นการรับรองและสามารถนำโปรเจคที่คุณสร้างนำเข้า Portfolio ของคุณอีกด้วย"
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Scientific Computing with Python",
    "intro": [
      "Python เป็นหนึ่งในภาษาการเขียนโปรแกรมที่มีความยืดหยุ่นและได้รับความนิยมมากที่สุดในปัจจุบัน ซึ่งคุณสามารถใช้มันได้กับทุกอย่าง ตั้งแต่การเขียนสคริปต์ขั้นพื้นฐาน (Basic scripting) จนไปถึงการสร้าง Machine learning",
      "ใน Scientific Computing with Python Certification นั้นคุ ณจะได้เรียนรู้พื้นฐานของ Python เช่น ตัวแปร ลูป เงื่อนไข และฟังก์ชันต่างๆ จากนั้นจะเรียนเพิ่มเกี่ยวกับโครงสร้างข้อมูลที่ซับซ้อน(Complex data structure) เครือข่าย(Networking) ฐานข้อมูลเชิงสัมพันธ์(Relational database) และการแสดงข้อมูล(Data vusualization)"
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python for Everybody",
        "intro": [
          "ในหลักสูตร Python for everybody เป็นหลักสูตรวิดีโอฟรีที่สอนเกี่ยวกับพื้นฐานการใช้ Python3",
          "ในหลักสูตรนี้สร้างขึ้นโดย Dr. Charles Severance (หรือที่รู้จักในชื่อ Dr. Chuck) เขาเป็นศาสตราจารย์ที่โรงเรียนสารสนเทศแห่งมหาวิทยาลัยมิชิแกน ซึ่งเขาสอนหลักสูตรที่เน้นด้านเทคโนโลยีต่างๆ รวมถึงการเขียนโปรแกรม การออกแบบฐานข้อมูล และการพัฒนาเว็บ ."
        ]
      },
      "scientific-computing-with-python-projects": {
        "title": "Scientific Computing with Python Projects",
        "intro": [
          "ถึงเวลาทดสอบทักษะ Python ของคุณแล้ว โดยจะให้คุณทำโปรเจคเหล่านี้ให้สำเร็จ เพื่อที่จะแสดงให้เห็นว่าคุณมีความรู้พื้นฐานที่ดีเกี่ยวกับ Python และมีคุณสมบัติสำหรับการได้รับการรับรองทางScientific Computing with Python Certification อีกด้วย"
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Data Analysis with Python",
    "intro": [
      "การวิเคราะห์ข้อมูลหรือ Data Analysis มีมาอย่างยาวนาน แต่ในช่วงไม่กี่ปีที่ผ่านมา นักพัฒนาได้ฝึกฝนโดยใช้เครื่องมือโอเพนซอร์สราคาแพงต่างๆ  เช่น Tableau หรือแม้กระทั่งเครื่องมือในปัจจุบันอย่าง Python, SQL และโอเพ่นไลบรารีอื่นๆ ทำให้ Data Analysis นั้นได้เปลี่ยนไปตลอดกาล",
      "ในหลักสูตร Data Analysis with Python Certification นี้ คุณจะได้เรียนรู้พื้นฐานของการวิเคราะห์ข้อมูลด้วย Python เมื่อสิ้นสุดหลักสูตรนี้ คุณจะรู้วิธีการอ่านข้อมูลจากแหล่งต่างๆ เช่น CSV และ SQL และวิธีใช้ไลบรารีอย่าง Numpy , Pandas, Matplotlib และ Seaborn เพื่อประมวลผลและแสดงข้อมูลเป็นภาพได้อย่างมีประสิทธิภาพ"
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Data Analysis with Python",
        "intro": [
          "ในหลักสูตรวิดีโอที่ครอบคลุมเนื้อหาเหล่านี้ซึ่งสร้างโดย Santiago Basulto ซึ่งคุณจะได้เรียนรู้เกี่ยวกับกระบวนการทั้งหมดของการวิเคราะห์ข้อมูล รวมถึงการอ่านข้อมูลจากหลายแหล่ง เช่น (CSV, SQL, Excel) การประมวลผลข้อมูลโดยใช้ NumPy และ Pandas และแสดงเป็นภาพ โดยใช้ Matplotlib และ Seaborn",
          "นอกจากนี้ เรายังได้รวมหลักสูตร Jupyter Notebook อย่างละเอียดและการอ้างอิง Python ฉบับย่อเพื่อรีเฟรชทักษะการเขียนโปรแกรมของคุณให้อีกด้วย"
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "การเรียนรู้พื้นฐานของไลบรารี NumPy ในเนื้อหาของหลักสูตรนี้ จะสอนโดย Keith Galli",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้วิธีการทำงานของไลบรารี NumPy และการเปรียบเทียบกับ built-in อื่นๆ ของ Python นอกจากนี้คุณยังจะได้เรียนรู้วิธีการเขียนโค้ดพร้อมกับการใช้ NumPy การจัดทำดัชนี(Indexing) การปรับรูปร่าง(Reshaping) การประยุกต์ใช้สถิติ และอื่นๆ อีกมากมาย"
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Data Analysis with Python Projects",
        "intro": [
          "มีหลายวิธีในการวิเคราะห์ข้อมูลด้วย Python ซึ่งการทำโปรเจคเหล่านี้ให้สำเร็จ จะถือว่าเป็นโอกาสที่ดีจะแสดงให้เห็นว่าคุณมีความรู้พื้นฐานที่ดีเกี่ยวกับการวิเคราะห์ข้อมูลด้วย Python",
          "การทำโปรเจคให้เสร็จสิ้นทั้งหมดจะได้รับสิทธิ์ประกาศไปรษณียบัตรในด้าย Data Analysis with Python"
        ]
      }
    }
  },
  "information-security": {
    "title": "Information Security",
    "intro": [
      "ในปัจจุบันมีการทำหลายๆอย่างด้วยระบบทางออนไลน์ ทำให้มีข้อมูลที่สำคัญจำนวนมากตกอยู่ในความเสี่ยง ไม่ว่าจะเป็น: ที่อยู่อีเมล รหัสผ่าน หมายเลขโทรศัพท์ หรือข้อมูลอื่นๆ ",
      "ด้วยการรับรองความปลอดภัยของข้อมูลหรือ Information Security นี้ คุณจะสร้างเว็บที่ปลอดภัยด้วย HelmetJS เพื่อเรียนรู้พื้นฐานของการปกป้องข้อมูลของผู้คนทางออนไลน์",
      "นอกจากนี้ คุณยังจะสร้างTCP Client และ Nmap และ Port Scanner ใน Python ที่จะช่วยให้คุณได้เรียนรู้เกี่ยวกับพื้นฐานของการทดสอบการเจาะระบบ ซึ่งเป็นองค์ประกอบที่สำคัญของการรักษาความปลอดภัยข้อมูลที่ดี"
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Information Security with HelmetJS",
        "intro": [
          "หลักสูตรการเขียนโปรแกรมนี้ จะเน้นที่ HelmetJS ซึ่งเป็นประเภทของมิดเดิลแวร์สำหรับแอปพลิเคชันที่ใช้ Express ซึ่งจะใช้ส่วนหัว HTTP โดยอัตโนมัติ วิธีนี้จะช่วยป้องกันไม่ให้ข้อมูลที่สำคัญส่งผ่านระหว่างเซิร์ฟเวอร์และไคลเอ็นต์โดยไม่ได้ตั้งใจ",
          "การเรียนหลักสูตรด้านล่างนี้จะช่วยให้คุณมีความเข้าใจวิธีป้องกันเว็บไซต์ของคุณจากพฤติกรรมสุ่มเสี่ยงหรือการโจมตีทางโลกไซเบอร์ได้"
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python for Penetration Testing",
        "intro": [
          "ในหลักสูตรวิดีโอเหล่านี้ จะสอนเกี่ยวกับการทดสอบการเจาะระบบด้วย Python หรือที่รู้จักกันว่า Pen test การทดสอบการเจาะคือการจำลองการโจมตีต่อระบบเพื่อตรวจสอบช่องโหว่ภายในระบบของเรา",
          "ในหลักสูตรนี้ คุณจะได้เรียนรู้เกี่ยวกับ socket, วิธีการสร้าง TCP server และ client, การสร้าง Nmap scanner, และเครื่องมือและเทคนิคอื่นๆ เกี่ยวกับ pen test ที่ใช้ในทุกๆวัน"
        ]
      },
      "information-security-projects": {
        "title": "Information Security Projects",
        "intro": [
          "ตอนนี้ได้เวลานำทักษะการรักษาความปลอดภัยข้อมูลใหม่ของคุณไปใช้งานจริงกัน โดยโปรเจคเหล่านี้จะทำให้คุณมีโอกาสในการใช้ทักษะ หลักการ และแนวคิดของ infosec ที่คุณได้เรียนรู้มาก่อนหน้านี้",
          "เมื่อคุณทำโปรเจคเสร็จแล้ว คุณจะมีโปรเจคการรักษาความปลอดภัยของข้อมูลมากมาย พร้อมกับประกาศไปรษณียบัตรที่สามารถนำไปใส่ portfolio ของคุณได้อีกด้วย"
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Machine Learning with Python",
    "intro": [
      "Machine Learning มีแอปพลิเคชันที่สามารถใช้ฝึกฝนรวมถึงทำงานได้หลากหลาย ซึ่งคุณสามารถนำไปใช้ในโปรเจคของคุณหรือในงานได้",
      "ใน Machine Learning นั้นใช้งานด้วย Python Certification ซึ่งคุณจะต้องใช้ TensorFlow เป็น Framework เพื่อสร้างโครงข่ายประสาทเทียม (Neural network) หลายเครือข่าย รวมถึงเทคนิคขั้นสูงอื่นๆ เช่น Natural language processing และ Reinforcement learning",
      "และคุณยังจะได้เรียนรู้เกี่ยวกับสู่โครงข่ายประสาทเทียม และเรียนรู้หลักการเบื้องหลังการทำงานของโครงข่ายประสาทแบบลึก (Deep) แบบการเกิดซ้ำ (Recurrent) และแบบบิดเบี้ยว (Convolutional)"
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "Tensorflow",
        "intro": [
          "TensorFlow เป็นFramework แบบ open source ที่จะทำให้ Machine Learning และ Neural Networking ใช้งานง่ายขึ้น",
          "ในหลักสูตรนี้สอนโดย Tim Ruscica หรือจะเรียกว่า “Tech With Tim” ก็ได้ ซึ่งจะช่วยสอนคุณให้เข้าใจ ถึง TensorFlow และความสามารถของ TensorFlow ที่จะทำให้คุณทึ่งได้"
        ]
      },
      "how-neural-networks-work": {
        "title": "How Neural Networks Work",
        "intro": [
          "โครงข่ายประสาทเทียมหรือ Neural network คือสาระสำคัญของสิ่งที่เราเรียกว่าปัญญาประดิษฐ์ (AI) ในปัจจุบัน แต่ในอดีตนั้น มีความยากและซับซ้อนมาก โดยเฉพาะอย่างยิ่งสำหรับผู้เริ่มต้นใน Machine Learning",
          "แม้ว่าคุณจะพึ่งรู้จักกับโครงข่ายประสาทเทียม แต่หลักสูตรวิดีโอเหล่านี้ที่สอนโดย Brandon Rohrer จะช่วยให้คุณคุ้นเคยกับแนวคิดและคณิตศาสตร์เบื้องหลังเกี่ยวกับเรื่อง Neural network มากขึ้น"
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Machine Learning with Python Projects",
        "intro": [
          " Machine Learning มีแอปพลิเคชันที่ช่วยให้คุณสามารถฝึกฝนได้อย่างมากมาย โดยสามารถทำโปรเจคการเขียนโปรแกรมที่ท้าทายและฟรีให้สำเร็จได้ จะแสดงให้เห็นว่าคุณมีความรู้พื้นฐานมากพอในเรื่อง Machine Learning และยังได้รับใบประกาศไปรษณียบัตรในด้าน Machine Learning with Python certification อีกด้วย "
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Coding Interview Prep",
    "intro": [
      "ถ้าหากคุณกำลังมองหาแบบฝึกหัดเขียนโค้ดฟรี สำหรับการเตรียมพร้อมในการสัมภาษณ์งานหรือใส่ลงใน Portfolio ของคุณ  พวกเราก็มีแหล่งการเรียนรู้ให้แก่พวกคุณได้เรียนรู้กัน",
      "ในส่วนนี้ จะมีโจทย์ความท้าทายในการเขียนโค้ดนับร้อยที่เอาไว้ทดสอบความรู้ของคุณเกี่ยวกับด้านอัลกอริทึม โครงสร้างของข้อมูล และคณิตศาสตร์ในการเขียนโปรแกรม นอกจากนี้ยังมีโปรเจคจำนวนหนึ่งที่คุณได้ทำเพื่อเสริมทักษะของคุณได้ หรือแม้กระทั่งนำโปรเจคที่ทำเพิ่มลงใน Portfolio ของคุณได้อีกด้วย"
    ],
    "note": "",
    "blocks": {
      "algorithms": {
        "title": "Algorithms",
        "intro": [
          "ในแบบฝึกหัดการเขียนโปรแกรมฟรีเหล่านี้จะสอนคุณเกี่ยวกับอัลกอริธึมทั่วไปที่สามารถพบได้ในชีวิตจริง ซึ่งถือว่าเป็นโอกาสที่ดีในการพัฒนาตรรกะและทักษะการเขียนโปรแกรมของคุณ",
          "อัลกอริธึมเหล่านี้ มักจะถูกใช้ในการสัมภาษณ์งานเพื่อทดสอบทักษะของผู้สมัคร พวกเราจะให้คำอธิบายที่กระชับและชัดเจนเกี่ยวกับวิธีการทำงานของอัลกอริธึมต่างๆ เหล่านี้ เพื่อให้คุณสามารถใช้โซลูชันสำหรับแต่ละขั้นตอนและยังเป็นแนวทางให้คุณได้"
        ]
      },
      "data-structures": {
        "title": "Data Structures",
        "intro": [
          "หลักสูตรการเขียนโปรแกรมฟรีเหล่านี้ มีไว้เพื่อช่วยให้คุณจัดการกับโครงสร้างข้อมูลขนาดใหญ่และซับซ้อนที่คุณอาจยังไม่คุ้นเคยและเพิ่มประสบการณ์ให้แก่คุณ",
          "ในการทำโจทย์ของหลักสูตรด้านล่างนี้ จะช่วยให้คุณได้เรียนรู้เกี่ยวกับโครงสร้างข้อมูลแต่ละประเภท และใช้อัลกอริธึมเพื่อเสริมสร้างความเข้าใจให้แก่คุณ"
        ]
      },
      "take-home-projects": {
        "title": "Take Home Projects",
        "intro": [
          "การสัมภาษณ์งานเขียนโปรแกรมนั้น เป็นเรื่องที่ค่อนข้างน่ากังวลใจอยู่เสมอ บางครั้งผู้สมัครงานเองอาจได้รับงานTake Home แล้วทำให้สำเร็จนอกรอบการสัมภาษณ์อีก การสัมภาษณ์ประเภทนี้ คุณจะต้องมีความรู้ในการงานจำนวนมาก แต่ก็ถือว่าเป็นวิธีที่ดีสำหรับนายจ้างที่จะเห็นว่าคุณมีตรรกะ ความคิดอย่างไรต่อการทำงานปฏิบัติหน้าที่",
          "โบนัสเพิ่มเติม! สำหรับโจทย์การทำโปรเจค เพื่อให้คุณได้ฝึกฝนเพิ่มเติม ถ้าคุณใช้เวลาของคุณ ทำให้โปรเจคออกมาได้อย่างยอดเยี่ยม คุณสามารถนำโปรเจคเหล่านี้ใส่ลงใน Portfolio ของคุณเพื่อแสดงถึงศักยภาพของคุณแก่นายจ้าง เพื่อเพิ่มความเป็นไปได้ในการเข้าทำงาน!"
        ]
      },
      "rosetta-code": {
        "title": "Rosetta Code",
        "intro": [
          "ไลบรารี Rosetta Code จะช่วยให้คุณยกระดับทักษะการแก้ปัญหาอย่างสร้างสรรค์ของคุณด้วยงานเขียนโปรแกรมฟรี",
          "โจทย์ท้าทายเหล่านี้เป็นเรื่องยากในการแก้ปัญหา แต่ว่าโจทย์เหล่านี้จะผลักดันตรรกะของอัลกอริทึมของคุณให้สูงขึ้นไปอีก"
        ]
      },
      "project-euler": {
        "title": "Project Euler",
        "intro": [
          " สำหรับโจทย์ Project Euler ขนาดใหญ่นี้ จะช่วยให้คุณเสริมสร้างความรู้ด้านอัลกอริทึมและคณิตศาสตร์ของคุณให้แข็งแกร่งยิ่งขึ้น ยกระดับยิ่งขึ้น อัพเลเวลของคุณมากขึ้น ถ้าหากคุณสามารถเขียนโค้ดพิชิตปัญหาโจทย์นี้ได้สำเร็จ",
          "ซึ่งโจทย์ปัญหานี้มีดีกรีความยากอยู่ในระดับสูง และยังต้องการประสบการณ์มากในการแก้ปัญหาแบบต่อเนื่องขึ้นเรื่อย ๆ หรือจะพูดอีกอย่างก็คือ การแก้ปัญหาหนึ่งปัญหาจะทำให้คุณได้รับแนวคิดใหม่ที่อาจจะช่วยให้คุณแก้ไขปัญหาก่อนหน้านี้ที่คุณยังไม่สามารถผ่านมันไปได้นั่นเอง “แล้วคุณล่ะ พร้อมที่จะพิชิตโจทย์ทุกข้อแล้วรึยัง” "
        ]
      }
    }
  },
  "pre-camp-software-engineer": {
    "title": "Pre Camp Software Engineer",
    "intro": [
      "เราใช้หลักการของการทดลองเรียน เพื่อพิสูจน์ว่าคุณมีความตั้งใจในการที่จะเรียนจบจริงๆ  ภายในเดือนแรกของการเรียน Software Engineering Certificate ผู้เข้าร่วมเรียนจะต้องทำการเรียนให้ผ่าน และได้รับ Pre Camp Software Engineer Certificate เท่านั้น เพราะว่าด้วยระยะเวลาที่คุณจะต้องเจอกับบททดสอบเป็นจำนวนมากในถัดๆ ไป การที่คุณได้ทดลองเรียนจะทำให้คุณเข้าใจตัวเองมากขึ้น ว่ามาถูกทางหรือไม่ และด้วยความเร่งรัด และความเหนื่อยที่ได้รับมา คุณพร้อมจะไปต่อหรือไม่",
      "การเขียน Code เพื่อเป็น Software Engineer เป็นหนึ่งในงานที่ยาก และต้องมีใจรักที่จะเรียนรู้จริงๆ ถ้าเกิดคุณทำโจทย์ใน Pre Camp แล้วมีความรู้สึกว่า เบื่อ ไม่สนุก เหนื่อย ขอให้ลองพิจารณาตัวเอง และลองมองหาสายงานอื่นๆ ในโลก Digital ที่มีอีกมากมายและขาดแคลนทั้งสิ้น เช่น Project Coordinator, Product Owner, Automated Tester, Business Analyst เป็นต้น "
    ],
    "note": "",
    "blocks": {
      "fill-in-the-main-questionaire": {
        "title": "กรอกแบบสอบถามหลักก่อนเริ่มเรียน",
        "intro": [
          "กรุณาเข้าไปที่ Link เพื่อกรอกแบบสอบถามก่อน",
          "** จำเป็นต้องทำ เพื่อให้ได้ Pre Camp Certificate ** "
        ]
      },
      "watch-video-it-career": {
        "title": "เรียนรู้ด้าน MBTi, DISC และสายงาน Digital Skills กับบุคลิกภาพของเรา",
        "intro": [
          "หนึ่งในสิ่งที่สำคัญก่อนจะเริ่มทำงานใดๆ คือต้องมีใจรักในสิ่งนั้นๆ และการที่เราจะรักในสิ่งนั้นๆ ได้ บุคลิกและความชอบของเราคือสิ่งสำคัญที่เป็นตัวกำหนด",
          "มาลองเข้าใจว่าหลักการของ MBTi และ DISC คืออะไร และในสายงาน Digital Skills มีกี่อาชีพที่เกี่ยวข้อง และแต่ละอาชีพเหมาะสมกับคนที่มีบุคลิกอย่างไร"
        ]
      },
      "watch-video": {
        "title": "[not use ]ดู Video HTML & Javascript Concept",
        "intro": [
          "[not use ]คุณ Oak ได้ทำการอธิบายให้เข้าใจถึงความเชื่อมโยงระหว่าง HTML และ Javascript รวมถึง Concept เพื่อให้เข้าใจในภาพรวมของ HTML และ Javascript ก่อนเริ่มทำโจทย์จริงๆ"
        ]
      },
      "watch-video-test": {
        "title": "ดู Video HTML & Javascript Concept",
        "intro": [
          "คุณ Oak ได้ทำการอธิบายให้เข้าใจถึงความเชื่อมโยงระหว่าง HTML และ Javascript รวมถึง Concept เพื่อให้เข้าใจในภาพรวมของ HTML และ Javascript ก่อนเริ่มทำโจทย์จริงๆ"
        ]
      },
      "test-test": { 
        "title": "ฝึกใช้งาน HTML แบบเบืองต้น และ Javascript เบื้องต้น", 
        "intro": [
          "HTML เป็นภาษาคอมพิวเตอร์ในรูปแบบหนึ่งที่ใช้สำาหรับสร้างหน้าเว็บ (Web Page) โดยระบบ CareerVio จะฝึกให้คุณได้เขียน Code และเห็นผลลัพธ์ทันที", 
          "ภาษา Javascript หรือย่อ JS เป็นภาษาเขียนโปรแกรมที่ถูกพัฒนาและปฏิบัติตามข้อกำหนดมาตรฐานของ ECMAScript และเป็นภาษาที่ได้รับการนิยมเป็นอย่างมากในช่วงหลังๆ เนื่องจากนำมาใช้ในการพัฒนางานได้หลายๆ อย่าง"
          ] 
        }
    }
  },
  "misc-text": {
    "certification": "{{cert}} Certification",
    "browse-other": "ดู Certificate อื่นๆ ของเราดังต่อไปนี้ (แนะนำว่าควนทำตามลำดับ)",
    "courses": "Courses",
    "steps": "Steps",
    "expand": "Expand",
    "collapse": "Collapse"
  }
}
